# Development tools — languages, compilers, runtimes, package managers
brew "asdf" # Extendable version manager with support for Ruby, Node.js, Elixir, Erlang & more. [ASDF](https://asdf-vm.com/)
brew "bun" # Incredibly fast JavaScript runtime, bundler, test runner, and package manager. [Bun](https://bun.sh/)
brew "cloc" # Count lines of code in many programming languages. [Cloc](https://github.com/AlDanial/cloc)
brew "delve" # Debugger for the Go programming language. [Delve](https://github.com/go-delve/delve)
brew "deno" # A secure runtime for JavaScript and TypeScript. [Deno](https://deno.land/)
brew "direnv" # Unclutter your .profile. [Direnv](https://direnv.net/)
brew "go" # The Go programming language. [Go](https://golang.org/)
brew "gopls" # Go language server for the Go programming language. [Gopls](https://github.com/golang/tools/tree/master/gopls)
brew "lua" # Powerful, efficient, lightweight, embeddable scripting language. [Lua](https://www.lua.org/)
brew "node" # JavaScript runtime built on Chrome's V8 JavaScript engine. [Node.js](https://nodejs.org/)
brew "numpy" # Fundamental package for scientific computing with Python. [Numpy](https://numpy.org/)
brew "pkgx" # A package manager that brings any command to any shell. [Pkgx](https://pkgx.dev/)
brew "pnpm" # Fast, disk space efficient package manager. [PNPM](https://pnpm.io/)
brew "python@3.13" # Python programming language, version 3.13. [Python](https://www.python.org/)
brew "rustup" # The Rust toolchain installer. [Rustup](https://rustup.rs/)
brew "shellcheck" # A shell script static analysis tool. [ShellCheck](https://www.shellcheck.net/)
brew "swift" # The Swift programming language. [Swift](https://swift.org/)
brew "uv" # Fast Python package and project manager (for serena/screencap MCP). [uv](https://github.com/astral-sh/uv)
brew "yarn" # JavaScript package manager. [Yarn](https://yarnpkg.com/)
