# Cloud, Kubernetes, and infrastructure tools
brew "ansible" # Automation tool for configuration management, application deployment, and task automation. [Ansible](https://www.ansible.com/)
brew "awscli" # Official Amazon AWS command-line interface. [AWS CLI](https://aws.amazon.com/cli/)
brew "cmctl" # Command-line tool for managing cert-manager Infrastructure resources. [cmctl](https://github.com/cert-manager/cmctl)
brew "coder/coder/coder" # Coder CLI tools. [Coder](https://github.com/coder/coder)
brew "hcloud" # Command-line interface for Hetzner Cloud. [hcloud](https://github.com/hetznercloud/cli)
brew "helm" # The Kubernetes package manager. [Helm](https://helm.sh/)
brew "hashicorp/tap/terraform" # Tool for building, changing, and versioning infrastructure safely and efficiently. [Terraform](https://www.terraform.io/)
brew "istioctl" # Command-line tool for Istio service mesh. [Istioctl](https://istio.io/latest/docs/ops/diagnostic-tools/istioctl/)
brew "k9s" # Kubernetes CLI to manage your clusters in style. [K9s](https://k9scli.io/)
brew "kind" # Kubernetes IN Docker - local clusters for testing Kubernetes. [Kind](https://kind.sigs.k8s.io/)
brew "kompose" # Tool to move from 'docker-compose' to Kubernetes. [Kompose](https://kompose.io/)
brew "krew" # Package manager for kubectl plugins. [Krew](https://krew.sigs.k8s.io/)
brew "kubectx" # Switch faster between clusters and namespaces in kubectl. [Kubectx](https://github.com/ahmetb/kubectx)
brew "kubernetes-cli" # Kubernetes command-line tool, kubectl. [Kubectl](https://kubernetes.io/docs/reference/kubectl/)
brew "kubeshark/kubeshark/kubeshark" # API traffic viewer for Kubernetes. [Kubeshark](https://kubeshark.co/)
brew "minikube" # Run Kubernetes locally. [Minikube](https://minikube.sigs.k8s.io/docs/)
brew "openshift-cli" # Command-line tool for OpenShift. [OpenShift CLI](https://docs.openshift.com/container-platform/latest/cli_reference/openshift_cli/getting-started-cli.html)
brew "opentofu" # OpenTofu, an open source fork of Terraform. [OpenTofu](https://opentofu.org/)
brew "derailed/popeye/popeye" # A Kubernetes cluster resource sanitizer. [Popeye](https://github.com/derailed/popeye)
brew "rancher-cli" # Command-line tool for Rancher, a container management platform. [Rancher CLI](https://rancher.com/docs/rancher/v2.x/en/cli/)
brew "rke" # Rancher Kubernetes Engine, a simple Kubernetes installer. [RKE](https://rancher.com/docs/rke/latest/en/)
brew "robusta-dev/holmesgpt/holmesgpt" # AI-powered Kubernetes troubleshooting agent (CNCF Sandbox). [HolmesGPT](https://github.com/robusta-dev/holmesgpt)
brew "krr" # Kubernetes Resource Reporter. [KRR](https://github.com/robusta-dev/krr)
brew "s3cmd" # Command line tool for managing Amazon S3 and CloudFront services. [S3cmd](https://s3tools.org/s3cmd)
brew "stern" # Multi pod and container log tailing for Kubernetes. [Stern](https://github.com/stern/stern)
