# Tap repositories for additional Homebrew formulas
tap "bramstein/webfonttools" # Tools for working with web fonts. [Webfonttools](https://github.com/bramstein/homebrew-webfonttools)
tap "buo/cask-upgrade" # Upgrade cask packages quickly. [Cask Upgrade](https://github.com/buo/homebrew-cask-upgrade)
tap "coder/coder" # Developer tools from Coder. [Coder](https://github.com/coder/homebrew-coder)
tap "derailed/popeye" # A Kubernetes cluster resource sanitizer. [Popeye](https://github.com/derailed/popeye)
tap "goodwithtech/r" # Tools for Kubernetes security. [R](https://github.com/goodwithtech/homebrew-r)
tap "hashicorp/tap" # HashiCorp tools. [HashiCorp](https://developer.hashicorp.com/terraform)
tap "homebrew/bundle" # Bundler for non-Ruby dependencies from Homebrew. [Homebrew Bundle](https://github.com/Homebrew/homebrew-bundle)
tap "homebrew/command-not-found" # Command-not-found hook for Homebrew. [Homebrew Command Not Found](https://github.com/Homebrew/homebrew-command-not-found)
tap "kubeshark/kubeshark" # API traffic viewer for Kubernetes. [Kubeshark](https://github.com/kubeshark/homebrew-tap)
tap "lotyp/formulae" # Various useful Homebrew formulas. [Lotyp Formulae](https://github.com/lotyp/homebrew-formulae)
tap "joshmedeski/sesh" # Sesh: A tool for managing shell sessions. [Sesh](https://github.com/joshmedeski/sesh)
tap "robusta-dev/homebrew-krr" # Kubernetes Resource Reporter. [KRR](https://github.com/robusta-dev/krr)
tap "robusta-dev/homebrew-holmesgpt" # Holmes GPT: A tool for managing GPT partitions. [Holmes GPT](https://github.com/robusta-dev/holmesgpt)
tap "molovo/revolver" # Revolver: A simple command-line tool for rotating text. [Revolver](https://github.com/molovo/revolver)

# Install various CLI tools and utilities
brew "ack" # A tool like grep, optimized for programmers. [Ack](https://beyondgrep.com/)
brew "act" # Run GitHub Actions locally. [Act](https://github.com/nektos/act)
brew "aircrack-ng" # A suite of tools to assess WiFi network security. [Aircrack-ng](https://www.aircrack-ng.org/)
brew "xz" # General-purpose data compression with high compression ratio. [XZ Utils](https://tukaani.org/xz/)
brew "ansible" # Automation tool for configuration management, application deployment, and task automation. [Ansible](https://www.ansible.com/)
brew "gmp" # Library for arbitrary-precision arithmetic. [GMP](https://gmplib.org/)
brew "coreutils" # GNU File, Shell, and Text utilities. [Coreutils](https://www.gnu.org/software/coreutils/)
brew "asdf" # Extendable version manager with support for Ruby, Node.js, Elixir, Erlang & more. [ASDF](https://asdf-vm.com/)
brew "python@3.11" # Python programming language, version 3.11. [Python](https://www.python.org/)
brew "awscli" # Official Amazon AWS command-line interface. [AWS CLI](https://aws.amazon.com/cli/)
brew "bash" # GNU Bourne-Again SHell, a command language interpreter. [Bash](https://www.gnu.org/software/bash/)
brew "bat" # A cat clone with syntax highlighting and Git integration. [Bat](https://github.com/sharkdp/bat)
brew "bfg" # BFG Repo-Cleaner: Remove large files or passwords from Git history. [BFG Repo-Cleaner](https://rtyley.github.io/bfg-repo-cleaner/)
brew "binutils" # GNU binary tools for native development. [Binutils](https://www.gnu.org/software/binutils/)
brew "numpy" # Fundamental package for scientific computing with Python. [Numpy](https://numpy.org/)
brew "p7zip" # 7-Zip (high compression file archiver) implementation. [P7zip](https://p7zip.sourceforge.net/)
brew "binwalk" # Firmware analysis tool. [Binwalk](https://github.com/ReFirmLabs/binwalk)
brew "btop" # Resource monitor that shows usage and stats for processor, memory, disks, network, and processes. [Btop](https://github.com/aristocratos/btop)
brew "cifer" # Simple, fast, and secure encryption tool. [Cifer](https://github.com/pshved/cifer)
brew "clair" # Static analysis for vulnerabilities in application containers (currently supports Docker). [Clair](https://github.com/quay/clair)
brew "cloc" # Count lines of code in many programming languages. [Cloc](https://github.com/AlDanial/cloc)
brew "ctop" # Top-like interface for container metrics. [Ctop](https://github.com/bcicen/ctop)
brew "cmctl" # Command-line tool for managing cert-manager Infrastructure resources. [cmctl](https://github.com/cert-manager/cmctl)
brew "delve" # Debugger for the Go programming language. [Delve](https://github.com/go-delve/delve)
brew "deno" # A secure runtime for JavaScript and TypeScript. [Deno](https://deno.land/)
brew "dex2jar" # Tools to work with Android .dex and Java .class files. [Dex2jar](https://github.com/pxb1988/dex2jar)
brew "diff-so-fancy" # Good-lookin' diffs. [Diff So Fancy](https://github.com/so-fancy/diff-so-fancy)
brew "direnv" # Unclutter your .profile. [Direnv](https://direnv.net/)
brew "dive" # A tool for exploring a Docker image, layer contents, and discovering ways to shrink the size of your Docker/OCI image. [Dive](https://github.com/wagoodman/dive)
brew "dns2tcp" # TCP over DNS tunnel tool. [Dns2tcp](https://github.com/alex-sector/dns2tcp)
brew "docker-compose" # Define and run multi-container applications with Docker. [Docker Compose](https://docs.docker.com/compose/)
brew "docker-slim" # Minify and secure Docker containers. [Docker Slim](https://github.com/docker-slim/docker-slim)
brew "entr" # Run arbitrary commands when files change. [Entr](http://eradman.com/entrproject/)
brew "exiv2" # Image metadata manipulation tool. [Exiv2](https://www.exiv2.org/)
brew "eza" # A modern replacement for ‘ls’. [eza](https://eza.rocks/)
brew "fcrackzip" # A ZIP password cracker. [Fcrackzip](https://github.com/hyc/fcrackzip)
brew "fd" # A simple, fast and user-friendly alternative to 'find'. [Fd](https://github.com/sharkdp/fd)
brew "findutils" # Collection of GNU find, xargs, and locate. [Findutils](https://www.gnu.org/software/findutils/)
brew "foremost" # A console program to recover files based on their headers and footers. [Foremost](http://foremost.sourceforge.net/)
brew "freetds" # Libraries to talk to Microsoft SQL Server and Sybase databases. [Freetds](https://www.freetds.org/)
brew "fzf" # A command-line fuzzy finder. [Fzf](https://github.com/junegunn/fzf)
brew "gh" # GitHub’s official command line tool. [GitHub CLI](https://cli.github.com/)
brew "ghostscript" # An interpreter for the PostScript language and for PDF. [Ghostscript](https://www.ghostscript.com/)
brew "git" # Distributed revision control system. [Git](https://git-scm.com/)
brew "git-delta" # A syntax-highlighting pager for git and diff output. [Git Delta](https://github.com/dandavison/delta)
brew "git-lfs" # Git extension for versioning large files. [Git LFS](https://git-lfs.github.com/)
brew "glow" # Render markdown on the CLI, with pizzazz! [Glow](https://github.com/charmbracelet/glow)
brew "gnu-sed" # GNU implementation of the famous stream editor. [GNU sed](https://www.gnu.org/software/sed/)
brew "gnupg" # GNU Pretty Good Privacy (PGP) package. [GnuPG](https://gnupg.org/)
brew "go" # The Go programming language. [Go](https://golang.org/)
brew "gopls" # Go language server for the Go programming language. [Gopls](https://github.com/golang/tools/tree/master/gopls)
brew "gox" # A dead simple, no frills Go cross compile tool. [Gox](https://github.com/mitchellh/gox)
brew "grep" # GNU grep, egrep and fgrep. [Grep](https://www.gnu.org/software/grep/)
brew "hadolint" # Dockerfile linter, validate inline bash, written in Haskell. [Hadolint](https://github.com/hadolint/hadolint)
brew "hashicorp/tap/terraform" # Tool for building, changing, and versioning infrastructure safely and efficiently. [Terraform](https://www.terraform.io/)
brew "hashpump" # A tool to exploit hash length extension attack. [Hashpump](https://github.com/bwall/HashPump)
brew "helm" # The Kubernetes package manager. [Helm](https://helm.sh/)
brew "holmesgpt" # A tool for managing GPT partitions. [Holmes GPT](https://github.com/robusta-dev/holmesgpt)
brew "lua" # Powerful, efficient, lightweight, embeddable scripting language. [Lua](https://www.lua.org/)
brew "highlight" # A universal source code to formatted text converter. [Highlight](http://www.andre-simon.de/doku/highlight/en/highlight.php)
brew "htop" # An interactive process viewer. [Htop](https://htop.dev/)
brew "mysql-client" # MySQL client tools. [MySQL](https://dev.mysql.com/downloads/shell/)
brew "hydra" # Very fast network logon cracker which supports many different services. [Hydra](https://github.com/vanhauser-thc/thc-hydra)
brew "imagemagick" # Tools and libraries to manipulate images in many formats. [ImageMagick](https://imagemagick.org/)
brew "istioctl" # Command-line tool for Istio service mesh. [Istioctl](https://istio.io/latest/docs/ops/diagnostic-tools/istioctl/)
brew "john" # John the Ripper password cracker. [John the Ripper](https://www.openwall.com/john/)
brew "jq" # Lightweight and flexible command-line JSON processor. [Jq](https://stedolan.github.io/jq/)
brew "k9s" # Kubernetes CLI to manage your clusters in style. [K9s](https://k9scli.io/)
brew "kind" # Kubernetes IN Docker - local clusters for testing Kubernetes. [Kind](https://kind.sigs.k8s.io/)
brew "knock" # A port-knocking server and client. [Knock](http://www.zeroflux.org/projects/knock)
brew "kompose" # Tool to move from 'docker-compose' to Kubernetes. [Kompose](https://kompose.io/)
brew "kotlin" # Kotlin programming language compiler and tools. [Kotlin](https://kotlinlang.org/)
brew "krb5" # Network authentication protocol. [Krb5](https://web.mit.edu/kerberos/)
brew "krew" # Package manager for kubectl plugins. [Krew](https://krew.sigs.k8s.io/)
brew "krr" # Kubernetes Resource Reporter. [KRR](https://github.com/robusta-dev/krr)
brew "kubeaudit" # Audit Kubernetes clusters for various security concerns. [Kubeaudit](https://github.com/Shopify/kubeaudit)
brew "kubectx" # Switch faster between clusters and namespaces in kubectl. [Kubectx](https://github.com/ahmetb/kubectx)
brew "kubernetes-cli" # Kubernetes command-line tool, kubectl. [Kubectl](https://kubernetes.io/docs/reference/kubectl/)
brew "kubescape" # Kubernetes security posture management. [Kubescape](https://github.com/kubescape/kubescape)
brew "lazydocker" # The lazier way to manage everything docker. [Lazydocker](https://github.com/jesseduffield/lazydocker)
brew "lazygit" # Simple terminal UI for git commands. [Lazygit](https://github.com/jesseduffield/lazygit)
brew "qemu" # Open source machine emulator and virtualizer. [QEMU](https://www.qemu.org/)
brew "qmk/qmk/qmk" # Quantum Mechanical Keyboard Firmware. [QMK](https://qmk.fm/)
brew "lima" # Linux virtual machines, typically on macOS, for running containerd. [Lima](https://github.com/lima-vm/lima)
brew "lynis" # Security auditing tool for UNIX-based systems. [Lynis](https://cisofy.com/lynis/)
brew "lynx" # Text-based web browser. [Lynx](https://lynx.invisible-island.net/)
brew "mackup" # Keep your application settings in sync (OS X/Linux). [Mackup](https://github.com/lra/mackup)
brew "markdown" # Text-to-HTML conversion tool. [Markdown](https://daringfireball.net/projects/markdown/)
brew "mas" # Mac App Store command line interface. [Mas](https://github.com/mas-cli/mas)
brew "minikube" # Run Kubernetes locally. [Minikube](https://minikube.sigs.k8s.io/docs/)
brew "minio-mc" # MinIO Client (mc) provides a modern alternative to UNIX commands like ls, cat, cp, mirror, diff, find etc. [MinIO Client](https://min.io/docs/minio/linux/reference/minio-mc.html)
brew "moreutils" # Additional Unix utilities. [Moreutils](https://joeyh.name/code/moreutils/)
brew "revolver" # A simple command-line tool for rotating text. [Revolver](https://github.com/molovo/revolver)
brew "neofetch" # A command-line system information tool. [Neofetch](https://github.com/dylanaraps/neofetch)
brew "neovim" # Ambitious Vim-fork focused on extensibility and usability. [Neovim](https://neovim.io/)
brew "netpbm" # Toolkit for manipulation of graphic images. [Netpbm](http://netpbm.sourceforge.net/)
brew "nmap" # Port scanning utility for large networks. [Nmap](https://nmap.org/)
brew "node" # JavaScript runtime built on Chrome's V8 JavaScript engine. [Node.js](https://nodejs.org/)
brew "nushell" # Nushell is a new shell that brings a rich and expressive scripting language to the command line. [Nushell](https://www.nushell.sh/)
brew "openshift-cli" # Command-line tool for OpenShift. [OpenShift CLI](https://docs.openshift.com/container-platform/latest/cli_reference/openshift_cli/getting-started-cli.html)
brew "openssh" # OpenBSD freely-licensed SSH connectivity tools. [OpenSSH](https://www.openssh.com/)
brew "opentofu" # OpenTofo, an open score for Terraform. [OpenTofu](https://opentofu.org/)
brew "pandoc" # Universal markup converter. [Pandoc](https://pandoc.org/)
brew "peco" # Simplistic interactive filtering tool. [Peco](https://github.com/peco/peco)
brew "php" # General-purpose scripting language that is especially suited to web development. [PHP](https://www.php.net/)
brew "zopfli" # Compression algorithm based on deflate. [Zopfli](https://github.com/google/zopfli)
brew "pigz" # Parallel implementation of gzip for modern multi-processor, multi-core machines. [Pigz](https://zlib.net/pigz/)
brew "pkl" # Tool for working with PKL files. [PKL](https://github.com/irmen/pickletools)
brew "pngcheck" # Verifies the integrity of PNG and dump information about PNG image files. [Pngcheck](http://www.libpng.org/pub/png/apps/pngcheck.html)
brew "pnpm" # Fast, disk space efficient package manager. [PNPM](https://pnpm.io/)
brew "podman" # Tool for managing OCI containers and pods. [Podman](https://podman.io/)
brew "podman-compose" # Docker Compose replacement for Podman. [Podman Compose](https://github.com/containers/podman-compose)
brew "pv" # Monitor the progress of data through a pipe. [Pv](https://linux.die.net/man/1/pv)
brew "pwgen" # Password generator. [Pwgen](https://github.com/tytso/pwgen)
brew "pyenv" # Simple Python version management. [Pyenv](https://github.com/pyenv/pyenv)
brew "qt@5" # Cross-platform application and UI framework (version 5). [Qt](https://www.qt.io/)
brew "rancher-cli" # Command-line tool for Rancher, a container management platform. [Rancher CLI](https://rancher.com/docs/rancher/v2.x/en/cli/)
brew "reattach-to-user-namespace" # Reattach process to user's login session. [Reattach to User Namespace](https://github.com/ChrisJohnsen/tmux-MacOSX-pasteboard)
brew "reg" # Docker registry v2 command line client. [Reg](https://github.com/genuinetools/reg)
brew "rename" # Renames multiple files. [Rename](https://manpages.debian.org/stretch/util-linux/rename.1.en.html)
brew "ripgrep" # Line-oriented search tool that recursively searches your current directory for a regex pattern. [Ripgrep](https://github.com/BurntSushi/ripgrep)
brew "rke" # Rancher Kubernetes Engine, a simple Kubernetes installer. [RKE](https://rancher.com/docs/rke/latest/en/)
brew "rlwrap" # Readline wrapper, allowing the use of readline features with arbitrary programs. [Rlwrap](https://github.com/hanslub42/rlwrap)
brew "rustup" # The Rust toolchain installer. [Rustup](https://rustup.rs/)
brew "s3cmd" # Command line tool for managing Amazon S3 and CloudFront services. [S3cmd](https://s3tools.org/s3cmd)
brew "sesh" # A tool for managing shell sessions. [Source](https://github.com/joshmedeski/sesh)
brew "shellcheck" # A shell script static analysis tool. [ShellCheck](https://www.shellcheck.net/)
brew "skopeo" # Command line utility that performs various operations on container images and image repositories. [Skopeo](https://github.com/containers/skopeo)
brew "socat" # Multipurpose relay (SOcket CAT). [Socat](http://www.dest-unreach.org/socat/)
brew "sqlmap" # Automatic SQL injection and database takeover tool. [Sqlmap](https://sqlmap.org/)
brew "ssh-copy-id" # brew "ssh-copy-id" # Add a public key to a remote machine's authorized_keys file. [Ssh-copy-id](https://www.openssh.com/manual.html)
brew "starship" # The minimal, blazing-fast, and infinitely customizable prompt for any shell! [Starship](https://starship.rs/)
brew "stern" # Multi pod and container log tailing for Kubernetes. [Stern](https://github.com/stern/stern)
brew "stow" # Manage installation of multiple software packages in the same directory tree. [Stow](https://www.gnu.org/software/stow/)
brew "swift" # The Swift programming language. [Swift](https://swift.org/)
brew "sysdig" # System-level exploration and troubleshooting tool. [Sysdig](https://sysdig.com/)
brew "tcpflow" # Captures TCP connections and stores data in a way that is convenient for protocol analysis and debugging. [Tcpflow](https://github.com/simsong/tcpflow)
brew "tcpreplay" # Suite of free Open Source utilities for editing and replaying previously captured network traffic. [Tcpreplay](https://tcpreplay.appneta.com/)
brew "tcptrace" # Tool for analyzing tcpdump output. [Tcptrace](http://www.tcptrace.org/)
brew "texlive" # A comprehensive distribution of TeX and LaTeX. [TeX Live](https://www.tug.org/texlive/)
brew "the_silver_searcher" # A code-searching tool similar to ack, but faster. [The Silver Searcher](https://github.com/ggreer/the_silver_searcher)
brew "tig" # Text-mode interface for Git. [Tig](https://jonas.github.io/tig/)
brew "tldr" # Simplified and community-driven man pages. [Tldr](https://tldr.sh/)
brew "tmux" # Terminal multiplexer. [Tmux](https://github.com/tmux/tmux)
brew "trash" # Command line interface to the macOS Trash. [Trash](https://hasseg.org/trash/)
brew "tree" # Display directories as trees (with optional color/HTML output). [Tree](http://mama.indstate.edu/users/ice/tree/)
brew "trivy" # A simple and comprehensive vulnerability/misconfiguration scanner for containers and other artifacts. [Trivy](https://github.com/aquasecurity/trivy)
brew "ucspi-tcp" # Command-line tools for building TCP client-server applications. [Ucspi-tcp](https://cr.yp.to/ucspi-tcp.html)
brew "vbindiff" # Visual binary diff, visually compare binary files. [Vbindiff](https://www.cjmweb.net/vbindiff/)
brew "wdiff" # Display word differences between text files. [Wdiff](https://www.gnu.org/software/wdiff/)
brew "wget" # Internet file retriever. [Wget](https://www.gnu.org/software/wget/)
brew "woff2" # Web Open Font Format 2.0. [Woff2](https://github.com/google/woff2)
brew "xpdf" # PDF viewer. [Xpdf](https://www.xpdfreader.com/)
brew "yarn" # JavaScript package manager. [Yarn](https://yarnpkg.com/)
brew "yq" # Portable command-line YAML processor. [Yq](https://github.com/mikefarah/yq)
brew "zoxide" # A smarter cd command, inspired by z and autojump. [Zoxide](https://github.com/ajeetdsouza/zoxide)
brew "zsh" # UNIX shell (command interpreter). [Zsh](https://www.zsh.org/)

# Additional tools from specific taps
brew "bramstein/webfonttools/sfnt2woff" # Convert sfnt (TrueType/OpenType) fonts to WOFF. [Sfnt2woff](https://github.com/bramstein/sfnt2woff)
brew "bramstein/webfonttools/sfnt2woff-zopfli" # Convert sfnt fonts to WOFF using Zopfli compression. [Sfnt2woff-zopfli](https://github.com/bramstein/sfnt2woff-zopfli)
brew "coder/coder/coder" # Coder CLI tools. [Coder](https://github.com/coder/coder)
brew "goodwithtech/r/dockle" # Container Image Linter for Security, Helping build the Best-Practice Docker Image. [Dockle](https://github.com/goodwithtech/dockle)
brew "kubeshark/kubeshark/kubeshark" # API traffic viewer for Kubernetes. [Kubeshark](https://kubeshark.co/)
brew "lotyp/formulae/dockutil" # Command-line interface for managing dock items. [Dockutil](https://github.com/kcrawford/dockutil)

# Install macOS applications
cask "1password" # Password manager and secure wallet. [1Password](https://1password.com/)
cask "1password-cli" # Command-line interface for 1Password. [1Password CLI](https://1password.com/downloads/command-line/)
cask "adobe-creative-cloud" # Adobe Creative Cloud suite. [Adobe Creative Cloud](https://www.adobe.com/creativecloud.html)
cask "android-sdk" # Android SDK. [Android SDK](https://developer.android.com/studio)
cask "arc" # The Arc browser. [Arc](https://arc.net/)
cask "balenaetcher" # Flash OS images to SD cards & USB drives. [Balena Etcher](https://www.balena.io/etcher/)
cask "bartender" # Organize your menu bar apps. [Bartender](https://www.macbartender.com/)
cask "basictex" # Small distribution of TeX and friends. [BasicTeX](https://www.tug.org/mactex/morepackages.html)
cask "cardhop" # Manage your contacts with ease. [Cardhop](https://flexibits.com/cardhop)
cask "cleanshot" # Screenshot and screen recording tool. [CleanShot](https://cleanshot.com/)
cask "container" # A tool to manage Docker containers. [Container](https://container.sh/)
cask "cursor" # AI powered VSCode. [Cursor](https://www.cursor.com/)
cask "discord" # Free voice and text chat for gamers. [Discord](https://discord.com/)
cask "elgato-stream-deck" # Stream Deck software. [Stream Deck](https://www.elgato.com/en/gaming/stream
cask "elgato-wave-link" # Wave Link software. [Wave Link](https://www.elgato.com/en/gaming/wave-3)
cask "figma" # Figma desktop app. [Figma](https://www.figma.com/)
cask "flutter" # Google's UI toolkit for building natively compiled applications. [Flutter](https://flutter.dev/)
cask "font-cascadia-mono" # Cascadia Mono font. [Cascadia Mono](https://github.com/microsoft/cascadia-code)
cask "font-fira-code" # Fira Code font. [Fira Code](https://github.com/tonsky/FiraCode)
cask "font-hack-nerd-font" # Hack Nerd Font. [Hack Nerd Font](https://github.com/ryanoasis/nerd-fonts)
cask "font-inconsolata" # Inconsolata font. [Inconsolata](https://fonts.google.com/specimen/Inconsolata)
cask "font-jetbrains-mono" # JetBrains Mono font. [JetBrains Mono](https://www.jetbrains.com/lp/mono/)
cask "font-jetbrains-mono-nerd-font" # JetBrains Mono Nerd Font. [JetBrains Mono Nerd Font](https://github.com/ryanoasis/nerd-fonts)
cask "font-meslo-lg-nerd-font" # Meslo LG Nerd Font. [Meslo LG Nerd Font](https://github.com/ryanoasis/nerd-fonts)
cask "font-open-sans" # Open Sans font. [Open Sans](https://fonts.google.com/specimen/Open+Sans)
cask "font-ubuntu" # Ubuntu font family. [Ubuntu Font](https://design.ubuntu.com/font/)
cask "franz" # Messaging app for WhatsApp, Slack, Telegram, and many more. [Franz](https://meetfranz.com/)
cask "fujitsu-scansnap-home" # Fujitsu ScanSnap Home software. [ScanSnap Home](https://www.fujitsu.com/global/products/computing/peripheral/scanners/scansnap/software/)
cask "ghostty" # Ghostty is a terminal emulator for DevOps Engineers. [Ghostty](https://ghostty.org/)
cask "gitkraken" # Git GUI client. [GitKraken](https://www.gitkraken.com/)
cask "google-chrome" # Fast, simple, and secure web browser, built for the modern web. [Google Chrome](https://www.google.com/chrome/)
cask "google-cloud-sdk" # Command-line interface for Google Cloud Platform products and services. [Google Cloud SDK](https://cloud.google.com/sdk)
cask "gpg-suite" # OpenPGP on macOS. [GPG Suite](https://gpgtools.org/)
cask "imageoptim" # Image optimization tool. [ImageOptim](https://imageoptim.com/mac)
cask "jetbrains-gateway" # Remote development gateway by JetBrains. [JetBrains Gateway](https://www.jetbrains.com/remote-development/gateway/)
cask "jetbrains-toolbox" # Manage all your JetBrains tools. [JetBrains Toolbox](https://www.jetbrains.com/toolbox-app/)
cask "kaleidoscope" # Powerful compare tool for macOS. [Kaleidoscope](https://kaleidoscope.app/)
cask "keepingyouawake" # Prevents your Mac from going to sleep. [KeepingYouAwake](https://keepingyouawake.app/)
cask "keymapp" # ZSA keymapp for flash and view keybord settings [keymapp](https://blog.zsa.io/keymapp/)
cask "kotlin-native" # Kotlin/Native compiler and tools. [Kotlin/Native](https://kotlinlang.org/docs/native-overview.html)
cask "kubenav" # Kubernetes and Helm dashboard. [Kubenav](https://kubenav.io/)
cask "lens" # Kubernetes IDE. [Lens](https://k8slens.dev/)
cask "linear-linear" # Linear is a project management tool for software teams. [Linear](https://linear.app/)
cask "logi-options+" # Logitech Options+ software. [Logi Options+](https://www.logitech.com/software/options.html)
cask "macfuse" # File system integration framework. [MacFUSE](https://osxfuse.github.io/)
cask "mission-control-plus" # Adds more functionality to Mission Control. [Mission Control Plus](https://fadel.io/missioncontrol/)
cask "notion" # All-in-one workspace. [Notion](https://www.notion.so/)
cask "notion-calendar" # Notion calendar integration. [Notion Calendar](https://www.notion.so/calendar)
cask "obs" # Free and open source software for video recording and live streaming. [OBS Studio](https://obsproject.com/)
cask "obsidian" # A powerful knowledge base on local Markdown files. [Obsidian](https://obsidian.md/)
cask "onekey" # App for crypto wallet. [OneKey](https://onekey.so/)
cask "orbstack" # Orbstack is a fast, light, and easy-to-use container and VM manager for macOS. [Orbstack](https://orbstack.dev/)
cask "parallels" # Run Windows on Mac without rebooting. [Parallels](https://www.parallels.com/)
cask "podman-desktop" # Desktop client for Podman. [Podman Desktop](https://podman-desktop.io/)
cask "proxyman" # Modern and intuitive HTTP Debugging Proxy app. [Proxyman](https://proxyman.io/)
cask "qlcolorcode" # Quick Look plugin for source code with syntax highlighting. [QLColorCode](https://github.com/anthonygelibert/QLColorCode)
cask "qlimagesize" # Quick Look plugin for displaying image size and resolution. [QLImageSize](https://github.com/Nyx0uf/qlImageSize)
cask "qlmarkdown" # Quick Look plugin for Markdown files. [QLMarkdown](https://github.com/toland/qlmarkdown)
cask "qlstephen" # Quick Look plugin for plain text files without a file extension. [QLStephen](https://github.com/whomwah/qlstephen)
cask "qlvideo" # Quick Look plugin for video files. [QLVideo](https://github.com/Marginal/QLVideo)
cask "qmk-toolbox" # QMK Toolbox is a keyboard firmware flashing and key tester tool. [QMK Toolbox](https://qmk.fm/toolbox/)
cask "quicklook-json" # Quick Look plugin for JSON files. [QuickLook JSON](https://github.com/sindresorhus/quick-look-plugins)
cask "quicklookase" # Quick Look plugin for Adobe Swatch Exchange (.ase) files. [QuicklookASE](https://github.com/rsodre/quicklookase)
cask "rapidapi" # RapidAPI Client for macOS. [RapidAPI](https://rapidapi.com/)
cask "raycast" # Blazing fast, totally extendable launcher. [Raycast](https://www.raycast.com/)
cask "reader" # reader, a read-later app [Readwise](https://readwise.io/read)
cask "screen-studio" # Screen recording and streaming software. [Screen Studio](https://screen.studio/)
cask "spotify" # Music streaming service. [Spotify](https://www.spotify.com/)
cask "stats" if OS.mac? # A utility to get your macOS statistics. [Stats](https://github.com/exelban/stats)
cask "superhuman" # Fastest email experience ever made. [Superhuman](https://superhuman.com/)
cask "syntax-highlight" # Quick Look plugin for source code with syntax highlighting. [Syntax Highlight](https://github.com/sbarex/SourceCodeSyntaxHighlight)
cask "the-unarchiver" # Unarchiving tool for many different archive formats. [The Unarchiver](https://theunarchiver.com/)
cask "tor-browser" # Anonymity online. [Tor Browser](https://www.torproject.org/)
cask "transmit" # Powerful and versatile file transfer app. [Transmit](https://panic.com/transmit/)
cask "vagrant" # Development environments made easy. [Vagrant](https://www.vagrantup.com/)
cask "vial" # Keyboard firmware for Atmel AVR and ARM USB families. [Vial](https://get.vial.moe/)
cask "vlc" # Open-source cross-platform multimedia player. [VLC](https://www.videolan.org/vlc/)
cask "webpquicklook" # Quick Look plugin for WebP image files. [WebPQuickLook](https://github.com/emin/WebPQuickLook)
cask "zed" # Collaborative code editor. [Zed](https://zed.dev/)
cask "zoom" # Video communication and virtual meeting platform. [Zoom](https://zoom.us/)

# Install macOS applications via Mac App Store
mas "Compressor", id: 424390742 # Powerful encoding companion to Final Cut Pro. [Compressor](https://apps.apple.com/us/app/compressor/id424390742)
mas "Final Cut Pro", id: 424389933 # Professional video editing software. [Final Cut Pro](https://apps.apple.com/us/app/final-cut-pro/id424389933)
mas "HP Smart", id: 1474276998 # Manage your HP printer. [HP Smart](https://apps.apple.com/us/app/hp-smart/id1474276998)
mas "Logic Pro", id: 634148309 # Professional music production software. [Logic Pro](https://apps.apple.com/us/app/logic-pro/id634148309)
mas "Medis", id: 1063631769 # Redis database management tool. [Medis](https://apps.apple.com/us/app/medis/id1063631769)
mas "Todoist", id: 585829637 # Task manager and to-do list application. [Todoist](https://todoist.com/)
mas "Xcode", id: 497799835 # Apple's IDE for macOS. [Xcode](https://developer.apple.com/xcode/)
