# Security and networking tools
brew "aircrack-ng" # A suite of tools to assess WiFi network security. [Aircrack-ng](https://www.aircrack-ng.org/)
brew "binutils" # GNU binary tools for native development. [Binutils](https://www.gnu.org/software/binutils/)
brew "binwalk" # Firmware analysis tool. [Binwalk](https://github.com/ReFirmLabs/binwalk)
brew "cifer" # Simple, fast, and secure encryption tool. [Cifer](https://github.com/pshved/cifer)
brew "dex2jar" # Tools to work with Android .dex and Java .class files. [Dex2jar](https://github.com/pxb1988/dex2jar)
brew "dns2tcp" # TCP over DNS tunnel tool. [Dns2tcp](https://github.com/alex-sector/dns2tcp)
brew "fcrackzip" # A ZIP password cracker. [Fcrackzip](https://github.com/hyc/fcrackzip)
brew "foremost" # A console program to recover files based on their headers and footers. [Foremost](http://foremost.sourceforge.net/)
brew "gnupg" # GNU Pretty Good Privacy (PGP) package. [GnuPG](https://gnupg.org/)
brew "hashpump" # A tool to exploit hash length extension attack. [Hashpump](https://github.com/bwall/HashPump)
brew "hydra" # Very fast network logon cracker which supports many different services. [Hydra](https://github.com/vanhauser-thc/thc-hydra)
brew "john" # John the Ripper password cracker. [John the Ripper](https://www.openwall.com/john/)
brew "knock" # A port-knocking server and client. [Knock](http://www.zeroflux.org/projects/knock)
brew "lynis" # Security auditing tool for UNIX-based systems. [Lynis](https://cisofy.com/lynis/)
brew "nmap" # Port scanning utility for large networks. [Nmap](https://nmap.org/)
brew "openssh" # OpenBSD freely-licensed SSH connectivity tools. [OpenSSH](https://www.openssh.com/)
brew "pass" # The standard unix password manager. [Pass](https://www.passwordstore.org/)
brew "pwgen" # Password generator. [Pwgen](https://github.com/tytso/pwgen)
brew "socat" # Multipurpose relay (SOcket CAT). [Socat](http://www.dest-unreach.org/socat/)
brew "sqlmap" # Automatic SQL injection and database takeover tool. [Sqlmap](https://sqlmap.org/)
brew "ssh-copy-id" # Add a public key to a remote machine's authorized_keys file. [Ssh-copy-id](https://www.openssh.com/manual.html)
brew "sysdig" # System-level exploration and troubleshooting tool. [Sysdig](https://sysdig.com/)
brew "tcpflow" # Captures TCP connections and stores data in a way that is convenient for protocol analysis and debugging. [Tcpflow](https://github.com/simsong/tcpflow)
brew "tcpreplay" # Suite of free Open Source utilities for editing and replaying previously captured network traffic. [Tcpreplay](https://tcpreplay.appneta.com/)
brew "tcptrace" # Tool for analyzing tcpdump output. [Tcptrace](http://www.tcptrace.org/)
brew "ucspi-tcp" # Command-line tools for building TCP client-server applications. [Ucspi-tcp](https://cr.yp.to/ucspi-tcp.html)
