# Core CLI tools — shell, editor, file utilities
brew "bash" # GNU Bourne-Again SHell, a command language interpreter. [Bash](https://www.gnu.org/software/bash/)
brew "bat" # A cat clone with syntax highlighting and Git integration. [Bat](https://github.com/sharkdp/bat)
brew "btop" # Resource monitor that shows usage and stats for processor, memory, disks, network, and processes. [Btop](https://github.com/aristocratos/btop)
brew "coreutils" # GNU File, Shell, and Text utilities. [Coreutils](https://www.gnu.org/software/coreutils/)
brew "entr" # Run arbitrary commands when files change. [Entr](http://eradman.com/entrproject/)
brew "eza" # A modern replacement for 'ls'. [eza](https://eza.rocks/)
brew "fd" # A simple, fast and user-friendly alternative to 'find'. [Fd](https://github.com/sharkdp/fd)
brew "fzf" # A command-line fuzzy finder. [Fzf](https://github.com/junegunn/fzf)
brew "glow" # Render markdown on the CLI, with pizzazz! [Glow](https://github.com/charmbracelet/glow)
brew "gnu-sed" # GNU implementation of the famous stream editor. [GNU sed](https://www.gnu.org/software/sed/)
brew "grep" # GNU grep, egrep and fgrep. [Grep](https://www.gnu.org/software/grep/)
brew "highlight" # A universal source code to formatted text converter. [Highlight](http://www.andre-simon.de/doku/highlight/en/highlight.php)
brew "jq" # Lightweight and flexible command-line JSON processor. [Jq](https://stedolan.github.io/jq/)
brew "just" # A handy way to save and run project-specific commands. [Just](https://just.systems/)
brew "less" # A pager program similar to more. [Less](https://www.greenwoodsoftware.com/less/)
brew "moreutils" # Additional Unix utilities. [Moreutils](https://joeyh.name/code/moreutils/)
brew "fastfetch" # Like neofetch, but much much faster. [Fastfetch](https://github.com/fastfetch-cli/fastfetch)
brew "neovim" # Ambitious Vim-fork focused on extensibility and usability. [Neovim](https://neovim.io/)
brew "tree-sitter-cli" # CLI for tree-sitter grammars — required by nvim-treesitter (main branch) to compile parsers.
brew "nushell" # Nushell is a new shell that brings a rich and expressive scripting language to the command line. [Nushell](https://www.nushell.sh/)
brew "pandoc" # Universal markup converter. [Pandoc](https://pandoc.org/)
brew "pv" # Monitor the progress of data through a pipe. [Pv](https://linux.die.net/man/1/pv)
brew "rename" # Renames multiple files. [Rename](https://manpages.debian.org/stretch/util-linux/rename.1.en.html)
brew "ripgrep" # Line-oriented search tool that recursively searches your current directory for a regex pattern. [Ripgrep](https://github.com/BurntSushi/ripgrep)
brew "rlwrap" # Readline wrapper, allowing the use of readline features with arbitrary programs. [Rlwrap](https://github.com/hanslub42/rlwrap)
brew "joshmedeski/sesh/sesh" # A tool for managing shell sessions. [Source](https://github.com/joshmedeski/sesh)
brew "starship" # The minimal, blazing-fast, and infinitely customizable prompt for any shell! [Starship](https://starship.rs/)
brew "stow" # Manage installation of multiple software packages in the same directory tree. [Stow](https://www.gnu.org/software/stow/)
brew "tldr" # Simplified and community-driven man pages. [Tldr](https://tldr.sh/)
brew "tmux" # Terminal multiplexer. [Tmux](https://github.com/tmux/tmux)
brew "trash" # Command line interface to the macOS Trash. [Trash](https://hasseg.org/trash/)
brew "tree" # Display directories as trees (with optional color/HTML output). [Tree](http://mama.indstate.edu/users/ice/tree/)
brew "watch" # Executes a program periodically, showing output fullscreen. [Watch](https://gitlab.com/procps-ng/procps)
brew "wget" # Internet file retriever. [Wget](https://www.gnu.org/software/wget/)
brew "yazi" # Blazing fast terminal file manager written in Rust. [Yazi](https://yazi-rs.github.io/)
brew "yq" # Portable command-line YAML processor. [Yq](https://github.com/mikefarah/yq)
brew "zoxide" # A smarter cd command, inspired by z and autojump. [Zoxide](https://github.com/ajeetdsouza/zoxide)
brew "zsh" # UNIX shell (command interpreter). [Zsh](https://www.zsh.org/)

# Compression and archiving
brew "p7zip" # 7-Zip (high compression file archiver) implementation. [P7zip](https://p7zip.sourceforge.net/)
brew "pigz" # Parallel implementation of gzip for modern multi-processor, multi-core machines. [Pigz](https://zlib.net/pigz/)
brew "xz" # General-purpose data compression with high compression ratio. [XZ Utils](https://tukaani.org/xz/)
brew "zopfli" # Compression algorithm based on deflate. [Zopfli](https://github.com/google/zopfli)
