# macOS applications (Homebrew Casks)
cask "1password" # Password manager and secure wallet. [1Password](https://1password.com/)
cask "1password-cli" # Command-line interface for 1Password. [1Password CLI](https://1password.com/downloads/command-line/)
cask "adobe-creative-cloud" # Adobe Creative Cloud suite. [Adobe Creative Cloud](https://www.adobe.com/creativecloud.html)
cask "arc" # The Arc browser. [Arc](https://arc.net/)
cask "balenaetcher" # Flash OS images to SD cards & USB drives. [Balena Etcher](https://www.balena.io/etcher/)
cask "bartender" # Organize your menu bar apps. [Bartender](https://www.macbartender.com/)
cask "basictex" # Small distribution of TeX and friends. [BasicTeX](https://www.tug.org/mactex/morepackages.html)
cask "cardhop" # Manage your contacts with ease. [Cardhop](https://flexibits.com/cardhop)
cask "cleanshot" # Screenshot and screen recording tool. [CleanShot](https://cleanshot.com/)
cask "claude-code" # Terminal-based AI coding assistant from Anthropic. [Claude Code](https://code.claude.com/)
cask "codex" # OpenAI's coding agent for the terminal. [Codex](https://github.com/openai/codex)
cask "container" # A tool to manage Docker containers. [Container](https://container.sh/)
cask "cursor" # AI powered VSCode. [Cursor](https://www.cursor.com/)
cask "discord" # Free voice and text chat for gamers. [Discord](https://discord.com/)
cask "elgato-stream-deck" # Stream Deck software. [Stream Deck](https://www.elgato.com/en/gaming/stream)
cask "elgato-wave-link" # Wave Link software. [Wave Link](https://www.elgato.com/en/gaming/wave-3)
cask "figma" # Figma desktop app. [Figma](https://www.figma.com/)
cask "flutter" # Google's UI toolkit for building natively compiled applications. [Flutter](https://flutter.dev/)
cask "fujitsu-scansnap-home" # Fujitsu ScanSnap Home software. [ScanSnap Home](https://www.fujitsu.com/global/products/computing/peripheral/scanners/scansnap/software/)
cask "ghostty" # Ghostty is a terminal emulator for DevOps Engineers. [Ghostty](https://ghostty.org/)
cask "gitbutler" # Git client with virtual branches, stacked PRs, and AI commit messages. CLI: `but`. [GitButler](https://gitbutler.com/)
cask "gitkraken" # Git GUI client. [GitKraken](https://www.gitkraken.com/)
cask "google-chrome" # Fast, simple, and secure web browser, built for the modern web. [Google Chrome](https://www.google.com/chrome/)
cask "gcloud-cli" # Command-line interface for Google Cloud Platform products and services. [Google Cloud SDK](https://cloud.google.com/sdk)
cask "gpg-suite" # OpenPGP on macOS. [GPG Suite](https://gpgtools.org/)
cask "imageoptim" # Image optimization tool. [ImageOptim](https://imageoptim.com/mac)
cask "jetbrains-gateway" # Remote development gateway by JetBrains. [JetBrains Gateway](https://www.jetbrains.com/remote-development/gateway/)
cask "jetbrains-toolbox" # Manage all your JetBrains tools. [JetBrains Toolbox](https://www.jetbrains.com/toolbox-app/)
cask "kaleidoscope" # Powerful compare tool for macOS. [Kaleidoscope](https://kaleidoscope.app/)
cask "keepingyouawake" # Prevents your Mac from going to sleep. [KeepingYouAwake](https://keepingyouawake.app/)
cask "keymapp" # ZSA keymapp for flash and view keyboard settings. [keymapp](https://blog.zsa.io/keymapp/)
cask "kubenav" # Kubernetes and Helm dashboard. [Kubenav](https://kubenav.io/)
cask "lens" # Kubernetes IDE. [Lens](https://k8slens.dev/)
cask "linear-linear" # Linear is a project management tool for software teams. [Linear](https://linear.app/)
cask "logi-options+" # Logitech Options+ software. [Logi Options+](https://www.logitech.com/software/options.html)
cask "macfuse" # File system integration framework. [MacFUSE](https://osxfuse.github.io/)
cask "microsoft-teams" # Microsoft Teams collaboration and communication platform. [Microsoft Teams](https://www.microsoft.com/en-us/microsoft-teams/group-chat-software)
cask "mission-control-plus" # Adds more functionality to Mission Control. [Mission Control Plus](https://fadel.io/missioncontrol/)
cask "notion" # All-in-one workspace. [Notion](https://www.notion.so/)
cask "notion-calendar" # Notion calendar integration. [Notion Calendar](https://www.notion.so/calendar)
cask "obs" # Free and open source software for video recording and live streaming. [OBS Studio](https://obsproject.com/)
cask "obsidian" # A powerful knowledge base on local Markdown files. [Obsidian](https://obsidian.md/)
cask "onekey" # App for crypto wallet. [OneKey](https://onekey.so/)
cask "orbstack" # Orbstack is a fast, light, and easy-to-use container and VM manager for macOS. [Orbstack](https://orbstack.dev/)
cask "parallels" # Run Windows on Mac without rebooting. [Parallels](https://www.parallels.com/)
cask "podman-desktop" # Desktop client for Podman. [Podman Desktop](https://podman-desktop.io/)
cask "proxyman" # Modern and intuitive HTTP Debugging Proxy app. [Proxyman](https://proxyman.io/)
cask "raycast" # Blazing fast, totally extendable launcher. [Raycast](https://www.raycast.com/)
cask "reader" # reader, a read-later app. [Readwise](https://readwise.io/read)
cask "screen-studio" # Screen recording and streaming software. [Screen Studio](https://screen.studio/)
cask "sipgate" # SIP client for making and receiving calls. [Sipgate](https://www.sipgate.com/)
cask "slack" # Team collaboration and messaging app. [Slack](https://slack.com/)
cask "spotify" # Music streaming service. [Spotify](https://www.spotify.com/)
cask "stats" if OS.mac? # A utility to get your macOS statistics. [Stats](https://github.com/exelban/stats)
cask "superhuman" # Fastest email experience ever made. [Superhuman](https://superhuman.com/)
cask "the-unarchiver" # Unarchiving tool for many different archive formats. [The Unarchiver](https://theunarchiver.com/)
cask "todoist-app" # Task management and to-do list app. [Todoist](https://todoist.com/)
cask "tor-browser" # Anonymity online. [Tor Browser](https://www.torproject.org/)
cask "transmit" # Powerful and versatile file transfer app. [Transmit](https://panic.com/transmit/)
cask "vagrant" # Development environments made easy. [Vagrant](https://www.vagrantup.com/)
cask "vlc" # Open-source cross-platform multimedia player. [VLC](https://www.videolan.org/vlc/)
cask "zed" # Collaborative code editor. [Zed](https://zed.dev/)
cask "zoom" # Video communication and virtual meeting platform. [Zoom](https://zoom.us/)

# Quick Look plugins
cask "qlcolorcode" # Quick Look plugin for source code with syntax highlighting. [QLColorCode](https://github.com/anthonygelibert/QLColorCode)
cask "qlimagesize" # Quick Look plugin for displaying image size and resolution. [QLImageSize](https://github.com/Nyx0uf/qlImageSize)
cask "qlmarkdown" # Quick Look plugin for Markdown files. [QLMarkdown](https://github.com/toland/qlmarkdown)
cask "qlstephen" # Quick Look plugin for plain text files without a file extension. [QLStephen](https://github.com/whomwah/qlstephen)
cask "qlvideo" # Quick Look plugin for video files. [QLVideo](https://github.com/Marginal/QLVideo)
cask "quicklook-json" # Quick Look plugin for JSON files. [QuickLook JSON](https://github.com/sindresorhus/quick-look-plugins)
cask "quicklookase" # Quick Look plugin for Adobe Swatch Exchange (.ase) files. [QuicklookASE](https://github.com/rsodre/quicklookase)
cask "syntax-highlight" # Quick Look plugin for source code with syntax highlighting. [Syntax Highlight](https://github.com/sbarex/SourceCodeSyntaxHighlight)
cask "webpquicklook" # Quick Look plugin for WebP image files. [WebPQuickLook](https://github.com/emin/WebPQuickLook)
