# Miscellaneous CLI tools
brew "act" # Run GitHub Actions locally. [Act](https://github.com/nektos/act)
brew "atuin" # Magical shell history with SQLite database, sync, and fuzzy search. [Atuin](https://atuin.sh/)
brew "bats-core" # Bash Automated Testing System. [Bats-core](https://github.com/bats-core/bats-core)
brew "freetds" # Libraries to talk to Microsoft SQL Server and Sybase databases. [Freetds](https://www.freetds.org/)
brew "gmp" # Library for arbitrary-precision arithmetic. [GMP](https://gmplib.org/)
brew "krb5" # Network authentication protocol. [Krb5](https://web.mit.edu/kerberos/)
brew "mackup" # Keep your application settings in sync (OS X/Linux). [Mackup](https://github.com/lra/mackup)
brew "mas" # Mac App Store command line interface. [Mas](https://github.com/mas-cli/mas)
brew "minio-mc" # MinIO Client (mc) provides a modern alternative to UNIX commands like ls, cat, cp, mirror, diff, find etc. [MinIO Client](https://min.io/docs/minio/linux/reference/minio-mc.html)
brew "mysql-client" # MySQL client tools. [MySQL](https://dev.mysql.com/downloads/shell/)
brew "pkl" # Tool for working with PKL files. [PKL](https://github.com/irmen/pickletools)
brew "qemu" # Open source machine emulator and virtualizer. [QEMU](https://www.qemu.org/)
brew "qt@5" # Cross-platform application and UI framework (version 5). [Qt](https://www.qt.io/)
brew "reattach-to-user-namespace" # Reattach process to user's login session. [Reattach to User Namespace](https://github.com/ChrisJohnsen/tmux-MacOSX-pasteboard)
brew "molovo/revolver/revolver" # A simple command-line tool for rotating text. [Revolver](https://github.com/molovo/revolver)
brew "sshpass" # Non-interactive SSH password authentication. [sshpass](https://sourceforge.net/projects/sshpass/)
brew "lotyp/formulae/dockutil" # Command-line interface for managing dock items. [Dockutil](https://github.com/kcrawford/dockutil)

# Hardware — keyboards, peripherals
brew "qmk/qmk/qmk" # Quantum Mechanical Keyboard Firmware. [QMK](https://qmk.fm/)
cask "qmk-toolbox" # QMK Toolbox is a keyboard firmware flashing and key tester tool. [QMK Toolbox](https://qmk.fm/toolbox/)
